Requests/Request_Calculator.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/">
   <soapenv:Header/>
   <soapenv:Body>
      <tem:Add>
         <tem:intA>{first_number}</tem:intA>
         <tem:intB>{second_number}</tem:intB>
      </tem:Add>
   </soapenv:Body>
</soapenv:Envelope>